KCX-Mapping-Convert/testdaten/EMCS/UIDSfromKidsReferences/EMCSGenericRefusalUids.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
<soap:Header>
<Header xmlns="http://www.eurtradenet.com/schemas/header/200310" soap:mustUnderstand="true">
<To>DE01.CSFALT.2144</To>
<From>DE01.CSFALT.2144</From>
<MessageID>EI20100519</MessageID>
<SentAt>2010-05-19 12:02:00 +0200</SentAt>
<Act>request</Act>
<MessageType>EMCSDeclarationRejected</MessageType>
<MessageVersion>1.0</MessageVersion>
</Header>
</soap:Header>
<soap:Body>
<Submit xmlns="http://www.eurtradenet.com/schemas/uids/emcs/body/200911"><EMCS><EMCSDeclarationRejected><AadReferenceCode>AadReferenceCode</AadReferenceCode><SequenceNumber>SequenceNumber</SequenceNumber><LocalReferenceNumber>LocalReferenceNumber</LocalReferenceNumber><RejectionDateAndTime>2010-07-16 15:56:00 +0200</RejectionDateAndTime><RejectionReason>RejectionReason</RejectionReason><Error><Type>ErrorType1</Type><Pointer>ErrorLocation1</Pointer><Reason>ErrorReason1</Reason><OriginalValue>OriginalAttributeValue1</OriginalValue></Error><Error><Type>ErrorType2</Type><Pointer>ErrorLocation2</Pointer><Reason>ErrorReason2</Reason><OriginalValue>OriginalAttributeValue2</OriginalValue></Error></EMCSDeclarationRejected></EMCS></Submit></soap:Body></soap:Envelope>

